<?php
session_start();
error_reporting(E_ALL);
ini_set('display_errors', '1');
date_default_timezone_set("Asia/Bangkok");

function debug_forminfo()
{
    echo "<pre>";
    var_dump($_POST);
    var_dump($_GET);
    var_dump($_SESSION);
    echo "</pre><hr/>";
}

function define_dbconnect()
{
    define('DB_USER', "<%= DB_USER %>");
    define('DB_PASSWORD', "<%= DB_PASSWORD %>");
    define('DB_NAME', "<%= DB_NAME %>");
    define('DB_SSO', "<%= DB_SSO %>");
    define('DB_HOST', "<%= DB_HOST %>");
}

function create_dbconnect($dbhost = DB_HOST)
{
    global $sapdb;
    if (isset($sapdb)) {
        return;
    }

    require_once 'class-sap-db.php';

    $dbuser = defined('DB_USER') ? DB_USER : '';
    $dbpassword = defined('DB_PASSWORD') ? DB_PASSWORD : '';
    $dbname = defined('DB_NAME') ? DB_NAME : '';
    // $dbhost = defined('DB_HOST') ? DB_HOST : '';

    $sapdb = new sapdb($dbuser, $dbpassword, $dbname, $dbhost);
}


function load_model($class_name)
{
  $path_to_file = "../models/" . $class_name . ".php";
  if (file_exists($path_to_file)) {
    require $path_to_file;
  }
}

spl_autoload_register("load_model");

$months_th =
    [
        "01" => "มกราคม",
        "02" => "กุมภาพันธ์",
        "03" => "มีนาคม",
        "04" => "เมษายน",
        "05" => "พฤษภาคม",
        "06" => "มิถุนายน",
        "07" => "กรกฎาคม",
        "08" => "สิงหาคม",
        "09" => "กันยายน",
        "10" => "ตุลาคม",
        "11" => "พฤศจิกายน",
        "12" => "ธันวาคม"
    ];

$submonths =
    [
        "01" => "ม.ค.",
        "02" => "ก.พ.",
        "03" => "มี.ค.",
        "04" => "เม.ษ.",
        "05" => "พ.ค.",
        "06" => "มิ.ย.",
        "07" => "ก.ค.",
        "08" => "ส.ค.",
        "09" => "ก.ย.",
        "10" => "ต.ค.",
        "11" => "พ.ย.",
        "12" => "ธ.ค."
    ];


$name_status = [
  "0" => "ยื่นคำขอใหม่อีกครั้ง",
  "1" => "กำลังตรวจสอบข้อมูล",
  "2" => "ตรวจสอบข้อมูลเรียบร้อย",
  "3" => "อยู่ระหว่างการดำเนินการ",
  "4" => "อนุมัติลงนามแล้ว",
  "5" => "ยกเลิกคำขอ"
];

$typename = [
  1 => "สัญญาบัตร",
  2 => "ต่ำกว่าสัญญาบัตร"
];

$filetype = [
  1 => "rn-forest-green", 
  2 => "warning"
];

$notify = [
  1 => 'ประกาศเปลี่ยนชื่อตัว-ชื่อสกุล', 
  2 => 'คำสั่งเปลี่ยนชื่อตัว-ชื่อสกุล'
];

$rank = [
  "พันเอก" => "พ.อ.",
  "พันเอกหญิง" => "พ.อ.หญิง",
  "พันโท" => "พ.ท.",
  "พันโทหญิง" => "พ.ท.หญิง",
  "พันตรี" => "พ.ต.",
  "พันตรีหญิง" => "พ.ต.หญิง",
  "ร้อยเอก" => "ร.อ.",
  "ร้อยเอกหญิง" => "ร.อ.หญิง",
  "ร้อยโท" => "ร.ท.",
  "ร้อยโทหญิง" => "ร.ท.หญิง",
  "ร้อยตรี" => "ร.ต.",
  "ร้อยตรีหญิง" => "ร.ต.หญิง",
  "จ่าสิบเอก" => "จ.ส.อ.",
  "จ่าสิบเอกหญิง" => "จ.ส.อ.หญิง",
  "จ่าสิบโท" => "จ.ส.ท.",
  "จ่าสิบโทหญิง" => "จ.ส.ท.หญิง",
  "จ่าสิบตรี" => "จ.ส.ต.",
  "จ่าสิบตรีหญิง" => "จ.ส.ต.หญิง",
  "สิบเอก" => "ส.อ.",
  "สิบเอกหญิง" => "ส.อ.หญิง",
  "สิบโท" => "ส.ท.",
  "สิบโทหญิง" => "ส.ท.หญิง",
  "สิบตรี" => "ส.ต.",
  "สิบตรีหญิง" => "ส.ต.หญิง",
  "นางสาว" => "น.ส.",
];

$name_rank = [
  "1" => "จอมพล",
  "2" => "พล.อ.",
  "3" => "พล.ท.",
  "4" => "พล.ท.หญฺิง",
  "5" => "พล.ต.",
  "6" => "พล.ต.หญิง",
  "7" => "พ.ท.",
  "8" => "พ.อ.",
  "9" => "พ.อ.หญิง",
  "10" => "พ.ท.",
  "11" => "พ.ท.หญิง",
  "12" => "พ.ต.",
  "13" => "พ.ต.หญิง",
  "14" => "ร.อ.",
  "15" => "ร.อ.หญิง",
  "16" => "ร.ท.",
  "17" => "ร.ท.หญิง",
  "18" => "ร.ต",
  "19" => "ร.ต.หญิง",
  "20" => "จ.ส.อ.",
  "21" => "จ.ส.อ.หญิง",
  "22" => "จ.ส.ท.",
  "23" => "จ.ส.ท.หญิง",
  "24" => "จ.ส.ต",
  "25" => "จ.ส.ต.หญิง",
  "26" => "ส.อ.",
  "27" => "ส.อ.หญิง",
  "28" => "ส.ท.",
  "29" => "ส.ท.หญิง",
  "30" => "ส.ต.",
  "31" => "ส.ต.หญิง",
  "32" => "อส.ทพ..",
  "33" => "อส.ทพ.หญิง",
  "34" => "พล.อส.",
  "35" => "นดย.",
  "36" => "นนร.",
  "37" => "นาย",
  "38" => "นาง",
  "39" => "น.ส.",
];

$status_bs_class = [
  0 => "danger",
  1 => "warning",
  2 => "rn-neon-blue",
  3 => "rn-green-light",
  4 => "success",
  5 => "danger"
];


// @NOTE Bypass Session
$_SESSION["ws16user"] = "1429900280771";
// $_SESSION["ws16user"] = "";
// $_SESSION["ws16group"] = "testws16group";
$_SESSION["ws16group"] = "1";
// $_SESSION["ws16group"] = "1";
// $_SESSION["ws16nameg"] = "testws16nameg";
define_dbconnect();
create_dbconnect();

?>